#include "stdio.h"
#include "assets.h"

void runRoundtable(){
    char enterKeyToContinue=',';

    printf("\n");
    printf("\t▩╔═════════════════╗▩\n");
    printf("\t▛ ▘▘▘▘▘▘▘▘▘▘▘▘▜\n");
    printf("\t▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n");
    printf("\t▟ ▘▘▘▘▘▘▘▘▘▘▘▘▙\n\n");
    // printf("\t▩▩▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▩▩\n");
    // printf("\t▩▩▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▩▩\n");
    printf("\t▜▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▛\n");
    printf("\t▐▐╱╲▌▌╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▛▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▜▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌           𐂂  𝑹 𝑶 𝑼 𝑵 𝑫 ◌ 𝑻 𝑨 𝑩 𝑳 𝑬 𓅃         ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌       ╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌     ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Name    Skibidi | Gay                 ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌        Level   21                            ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Shards  ◈ ◆ ◈ ◈ ◇ ◇                   ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌       ╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌     ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        1▸ Fast Travel      4▸ Shop           ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌        2▸ Level Up         5▸ Save           ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        3▸ Inventory        0▸ Quit Game      ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌\t\t\t\t\t\t    ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Enter any key to continue:            ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌\t\t\t\t\t\t    ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌\t\t\t\t\t\t    ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▙▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▟▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳▐▐╱╲▌▌\n");
    printf("\t▟▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▙\n");

    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &enterKeyToContinue);
}

void runMiscellaneous(){
    char enterKeyToContinue=',';

    printf("\n");
    printf("\tMusical Characters 𝄡 𝄠 𝄤\n");
    printf("\tTai Xuan 𝌗𝍔𝍎\n");
    printf("\t𐂂 ＲＯＵＮＤ ＴＡＢＬＥ 𓅃\n");
    printf("\t𐂂 𐌺𐍈𐌵𐌽𐌳Ｄ ＴＡＢＬＥ \n");
    printf("\tMathematics 𝑹𝑶𝑼𝑵𝑫 𝑻𝑨𝑩𝑳𝑬\n");
    printf("\tCalligraphy 🌜 𝓡𝓸𝓾𝓷𝓭 𝓣𝓪𝓫𝓵𝓮 🌛\n");
    printf("\tDomino 🁒 Cards 🂷 Foggy 🌁 Earth 🌍🌎🌏\n");
    printf("\tPlanets 🌒🌜🌛\n");
    printf("\tFood 🍋🍓🍟🍵🍸🍷🥣🥛🥤🍶🍺🍰\n");
    printf("\tAnimals 🐙🦖🦕🦁🦍🦌🦇🦑🐉🐁🐀🐛🐜🐝🐍👹👺👻💀👽\n");
    printf("\tArmour 👙👑👚👘👖\n");
    printf("\tItems 💣🔒🔓📯💲💰💜💛💚💙🗡\n");
    printf("\tIcons 🛈🛸🠝🠭🡁🡹\n");
    printf("\tEmojis 🤓🧟\n");
    printf("\tRune 𖨠🞉🞕\n");

    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &enterKeyToContinue);
}