#include "stdio.h"
#include "conio.h"
#include "string.h"
#include "assets.h"

void theBoiledOne(){
    char iDontHearTheScreamsOfThousands=',';
    printf("\t\n");
    printf("\t\n");
    printf("\tGreyscale Values @%%#*+=-:.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@BBBBBBB%%888B@$$$$$$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@B%%8&WWWWMMM##***M&B$$$$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$@@@%%8&WM#**++=====----=#&B$$$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$@%%&WM#*+=====-----:::--==*W%%@$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$BW*++===---=--::::::--====+#W8%%@$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$B&*===========-::::::-====---=*WB$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$@&#==--=========-:::::-===-:...-#%%$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$B8#+=---==+++====-::::--==-:.. .-MB$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$B8#+==---==+++==+=-:::-----:.   .=W@$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$@8#+=-----====+====-::::----:.  .-#8@$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$@%%M+---::-----======-:..::--:..  :*&B@$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$BW+---:::---::--==--:....::-:.. .=M%%@$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$BW+--:::::--:..::---:.  ..::::...:*8@$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$@@@BW+--:::..:--:...::--:. ..:::::...-M%%@$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$@@@@%%M=::::...:-:.. .::--::..::--::..:=M%%@@$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$BM=:......:--:..:-----------::...:+W%%B@$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$@W=:.... .:-=----==--:-==--::::..-#8BB@$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$BW+:...  .:-=======-:::-==--:::.:-M%%@@$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$BW*=:..  ..:-======-:..:---:::...=WB@@$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$@%%8&M+-:....::------:.....:::....:+&@$@$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$@BB@@%%W#+-:...::::::..      ......:*8@$$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$BB@$$@B8W*-:.......            ...:*8$$$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$@B@$$$$$@%%W+-:...                ..:+8@$$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$@@$$$$$$$@%%W+-...               ....=MB$$$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$@@$$$$$$$$@B%%W=:...              ....:+WB$$$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$@@%%M=:...             .:...:+WB$$$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$@$@8M+=::.            .::. .:=W@$$$$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$B%%8M*=:.           .::.   :*8@$$$$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$@B&#+-.         ..::.   .-*W%%@$$$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$B8W+:.        .:::..   .:=#8@$$$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@B%%W+:.      ..:-:..     .:*8@$$$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@@@%%M=.     ..::-:..      .-*&B$$$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@@$@8*-..   ..::::..       .:+WB$$$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$@$$BW+:.....::::..          :+WB$$$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%M-....:::::..           :+WB$$$$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@&+:..:::::...            :+WB$$$$$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$BM=...::::..              :=M%%@$$$$$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$8+. ..::...               .=#&%%B$$$$$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@$$$$$$%%*.  .....                 .:=*M8B$$$$\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$&=.   ..                     .:-+M8@$$\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$BM-                             ..-*W%%@\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%*.                                :=*W\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$&=.                                 .:-\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@W=.\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$8*:. \n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@&*-\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@&+.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%*.\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%*.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$&+.\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@W-\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%#:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@W=.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@&+:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@8*:\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$$@8*:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$$B&*-.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$$BW+:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$$@&+:\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$$@&+:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$$@8*:\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$$8*:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$BM-.\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$B#:\n");
    // printf("\t$$$$$$$$$$$$$$$$$$$$$$$BM-\n");
    printf("\t$$$$$$$$$$$$$$$$$$$$$$$@W-\n");
    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &iDontHearTheScreamsOfThousands);
}

void wallBorder(int scrLen, char* flavorText1, char* flavorText2){ // Note that Screen Length (scrLen) is for the size of screen and flavor text
    int i=0, lineSize=(scrLen*2)+1; // +1 Don't forget to take into account the null byte :D
    char displayText1[lineSize];
    char displayText2[lineSize];
    
    for (i=0; i<lineSize-1;i++){ // -1 is to exclude the null byte in the print
        displayText1[i]=' ';
        displayText2[i]=' ';
    }

    for (i=0; i<lineSize;i++){
        if (flavorText1[i]==';'){
            i=lineSize;
        } else {
            displayText1[i]=flavorText1[i];
        }
    }

    for (i=0; i<lineSize;i++){
        if (flavorText2[i]==';'){
            i=lineSize;
        } else {
            displayText2[i]=flavorText2[i];
        }
    }

    printf("\t▐▐╱╲▌▌");
    printf("%s", displayText1);
    printf("▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌");
    printf("%s", displayText2);
    printf("▐▐╲╱▌▌\n");
}

void borderTopBottom(int scrLen, char which){ 
    int i=0,j=0;
    int top[3]={1,2,3}, bottom[3]={4,5,6}, heaven[3]={0,0,0};

    if (which=='t'){
        for (i=0;i<3;i++) heaven[i]=top[i];
    } else{
        for (i=0;i<3;i++) heaven[i]=bottom[i];
    }
    
    for (i=0;i<3;i++){
        switch (heaven[i]){
            case 1:
                printf("\t▜▙▟▙▟");
                for (j=0;j<scrLen+1;j++) printf("▙▟");
                printf("▙▟▙▟▛\n");
                break;
            case 2:
                printf("\t▐▐╱╲▌▌");
                for (j=0;j<scrLen;j++) printf("╳╳");
                printf("▐▐╱╲▌▌\n");
                break;
            case 3:
                printf("\t▐▐╲╱▌▛");
                for (j=0;j<scrLen;j++) printf("▔▔");
                printf("▜▐╲╱▌▌\n");
                break;
            case 4:
                printf("\t▐▐╱╲▌▙");
                for (j=0;j<scrLen;j++) printf("▂▂");
                printf("▟▐╱╲▌▌\n");
                break;
            case 5:
                printf("\t▐▐╲╱▌▌");
                for (j=0;j<scrLen;j++) printf("╳╳");
                printf("▐▐╲╱▌▌\n");
                break;
            case 6:
                printf("\t▟▛▜▛▜");
                for (j=0;j<scrLen;j++) printf("▛▜");
                printf("▛▜▛▜▛▜▙\n");
                break;
        }
    }

}

void runRoundtable2(){
    int screenLength=21; // This also acts as array/flavor text size
    printf("\n");
    borderTopBottom(screenLength, 't');
    wallBorder(screenLength, " Har har har har har;", " Five Nights at Feddys;"); // Flavor text should not exceed screen length
    wallBorder(screenLength, ";", ";"); // End flavor text with semicolon(;)
    wallBorder(screenLength, ";", ";");
    borderTopBottom(screenLength, 'b');
    printf("\n\tEnter any key to continue... ");
    getch();
}

void runRoundtable(){
    char enterKeyToContinue=',';

    printf("\n");
    // printf("\t▩╔═════════════════╗▩\n");
    // printf("\t▛ ▘▘▘▘▘▘▘▘▘▘▘▘▜\n");
    // printf("\t▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n");
    // printf("\t▟ ▘▘▘▘▘▘▘▘▘▘▘▘▙\n\n");
    // printf("\t▩▩▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▩▩\n");
    // printf("\t▩▩▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▧▨▩▩\n");
    printf("\t▜▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▙▟▛\n");
    printf("\t▐▐╱╲▌▌╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▛▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▜▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌           𐂂  𝑹 𝑶 𝑼 𝑵 𝑫 ◌ 𝑻 𝑨 𝑩 𝑳 𝑬 𓅃       🞉 12    ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌       ╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌           ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Name    Name | Class                        ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌        Level   integer                             ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Shards  ◈ ◆ ◈ ◈ ◇ ◇                         ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌       ╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌           ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        1▸ Fast Travel      4▸ Shop                 ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌        2▸ Level Up         5▸ Save                 ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        3▸ Inventory        0▸ Quit Game            ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌\t\t\t\t\t\t          ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌        Enter any key to continue:                  ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▌\t\t\t\t\t\t          ▐▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌\t\t\t\t\t\t          ▐▐╱╲▌▌\n");
    printf("\t▐▐╲╱▌▙▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▟▐╲╱▌▌\n");
    printf("\t▐▐╱╲▌▌╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳╳▐▐╱╲▌▌\n");
    printf("\t▟▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▛▜▙\n");

    //Gamer nation
    printf("\n");
    printf("\tEnter any key to continue : ");
    // gotoxy(20, 10);
    enterKeyToContinue=getch();
    printf("\t testing %c\n", enterKeyToContinue);
    // scanf(" %c", &enterKeyToContinue);
}

void runMap(){
    char enterKeyToContinue=',';

    
    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &enterKeyToContinue);
}

void runColor(){
    char enterKeyToContinue=',';

    printf("\x1b[38;5;20m");
    printf("\tAmongus\n");
    printf("\x1b[38;5;123m");
    printf("\tAmongus\n");
    printf("\x1b[48;5;52m");
    printf("\tAmongus\n");
    printf("\x1b[0m");
    printf("\tAmongus\n");
    printf("\tAmongus\n");
    printf("\tAmongus\n");
    printf("\x1b[0m");//resets
    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &enterKeyToContinue);
}

void runMiscellaneous(){
    char enterKeyToContinue=',';

    printf("\n");
    printf("\tMusical Characters 𝄡 𝄠 𝄤\n");
    printf("\tTai Xuan 𝌗𝍔𝍎\n");
    printf("\t𐂂 ＲＯＵＮＤ ＴＡＢＬＥ 𓅃\n");
    printf("\t𐂂 𐌺𐍈𐌵𐌽𐌳Ｄ ＴＡＢＬＥ \n");
    printf("\tMathematics 𝑹𝑶𝑼𝑵𝑫 𝑻𝑨𝑩𝑳𝑬\n");
    printf("\tCalligraphy 🌜 𝓡𝓸𝓾𝓷𝓭 𝓣𝓪𝓫𝓵𝓮 🌛\n");
    printf("\tDomino 🁒 Cards 🂷 Foggy 🌁 Earth 🌍🌎🌏\n");
    printf("\tPlanets 🌒🌜🌛\n");
    printf("\tFood 🍋🍓🍟🍵🍸🍷🥣🥛🥤🍶🍺🍰\n");
    printf("\tAnimals 🐙🦖🦕🦁🦍🦌🦇🦑🐉🐁🐀🐛🐜🐝🐍👹👺👻💀👽\n");
    printf("\tArmour 👙👑👚👘👖\n");
    printf("\tItems 💣🔒🔓📯💲💰💜💛💚💙🗡\n");
    printf("\tIcons 🛈🛸🠝🠭🡁🡹\n");
    printf("\tEmojis 🤓🧟\n");
    printf("\tRune 𖨠🞉🞕\n");

    printf("\n");
    printf("\tEnter any key to continue : ");
    scanf(" %c", &enterKeyToContinue);
}